Revit 2026 API

# PartUtilsGetSplittingCurves(Document, ElementId) Method

---

Identifies the curves that were used to create the part.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<Curve> GetSplittingCurves(
	Document document,
	ElementId partId
)
```
```vb
Public Shared Function GetSplittingCurves (
	document As Document,
	partId As ElementId
) As IList(Of Curve)
```
```cpp
public:
static IList<Curve^>^ GetSplittingCurves(
	Document^ document,
	ElementId^ partId
)
```
```fsharp
static member GetSplittingCurves :
        document : Document *
        partId : ElementId -> IList<Curve>
```

#### Parameters

document Document
     The source document of the part.
partId ElementId
     The part id.

#### Return Value

IListCurve The curves that created the part. Empty if partId is not a Part or Part is not divided.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PartUtils Class

GetSplittingCurves Overload

Autodesk.Revit.DB Namespace